Tekla.Structures.Analysis.AnalysisResult
The AnalysisResult class contains analysis result information.
The following example queries a single analysis result value.
using Tekla.Structures.Analysis;
public class Example
{
public void Example1()
{
int PartId = 0;
AnalysisResult AnalysisResult = new AnalysisResult();
AnalysisResult.ObjectType = AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_PART;
AnalysisResult.ObjectId = PartId;
AnalysisResult.LoadCase = (int)AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_ABSOLUTE_VALUE;
AnalysisResult.Position = AnalysisResult.ResultPositionEnum.POSITION_BEAM_START_POINT;
AnalysisResult.PositionCoordX = 0.0;
AnalysisResult.PositionCoordY = 0.0;
AnalysisResult.PositionCoordZ = 0.0;
AnalysisResult.PositionTolerance = 0.1;
AnalysisResult.ValueType = AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Y;
bool Result = AnalysisResult.QueryAnalysisResult();
double ResultValue = AnalysisResult.Value;
}
}

Tekla.Structures.Analysis.AnalysisResult.analysisModelName
Name of the analysis model (not used currently)

Tekla.Structures.Analysis.AnalysisResult.objectType
ObjectType, in result query the only supported type is physical member (part)

Tekla.Structures.Analysis.AnalysisResult.objectId
Id of the Object

Tekla.Structures.Analysis.AnalysisResult.modId
Modification ID (result time stamp)

Tekla.Structures.Analysis.AnalysisResult.ObjectType
The object type. In result query the only supported type is the physical member (the part).

Tekla.Structures.Analysis.AnalysisResult.ObjectId
The identifier of the object.
If ObjectType is OBJECT_TYPE_PART, ObjectId is (physical) part ID.
If ObjectType is OBJECT_TYPE_MEMBER, ObjectId is the bar number when analysis bars are used in integration,
otherwise ObjectId is the member number.
If ObjectType is OBJECT_TYPE_AREA, ObjectId is the area number.

Tekla.Structures.Analysis.AnalysisResult.LoadCase
The load case.
The real load cases have positive values 1, 2, 3, ...
For min/max queries LoadCaseForMinMaxEnum can be used.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseName
The load case name (max length 64).

Tekla.Structures.Analysis.AnalysisResult.LoadCaseType
The load case type.

Tekla.Structures.Analysis.AnalysisResult.LoadCaseInfo
The load case info (optional, max length 128).

Tekla.Structures.Analysis.AnalysisResult.Position
The position on the part's START/END/...

Tekla.Structures.Analysis.AnalysisResult.PositionCoordX
Global coordinate X (mm) when inserting result.
Local (part) coordinate X (mm) when getting results.

Tekla.Structures.Analysis.AnalysisResult.PositionCoordY
Global coordinate Y (mm) when inserting result.
Local (part) coordinate Y (mm) when getting results.

Tekla.Structures.Analysis.AnalysisResult.PositionCoordZ
Global coordinate Z (mm) when inserting result.
Local (part) coordinate Z (mm) when getting results.

Tekla.Structures.Analysis.AnalysisResult.PositionTolerance
The position's coordinate tolerance.

Tekla.Structures.Analysis.AnalysisResult.Value
The result value.

Tekla.Structures.Analysis.AnalysisResult.ValueType
The result value type.

Tekla.Structures.Analysis.AnalysisResult.ModId
The time stamp of the result.

Tekla.Structures.Analysis.AnalysisResult.#ctor
Creates a new analysis result instance.

Tekla.Structures.Analysis.AnalysisResult.Delete(Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum,System.Int32)
Delete analysis results by the given key.
objectType: Object type.
objectId: Object id.
Returns: True if successful.
Delete all analysis results of part.
var result = AnalysisResult.Delete(AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_PART, analysisPart.PartID.ID);

Tekla.Structures.Analysis.AnalysisResult.DeleteLoadcase(System.Int32,System.String)
Delete analysis results by load case.
loadcaseNumber: Object type.
loadcaseName: Object id.
Returns: True if successful.
Delete all analysis results of part.
var result = AnalysisResult.DeleteLoadcase(11, "ULS1");

Tekla.Structures.Analysis.AnalysisResult.DeleteAll
Delete all analysis results.
Returns: True if successful.
Delete all analysis results.
var result = AnalysisResult.DeleteAll();

Tekla.Structures.Analysis.AnalysisResult.GetResultObjectIds(Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum)
Get ID numbers of objects with results.
objectType: The object type.
Returns: The ID numbers of objects with results.

Tekla.Structures.Analysis.AnalysisResult.GetResults(System.Nullable{Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum},System.Nullable{System.Int32},System.Nullable{Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum},Tekla.Structures.Geometry3d.Point,System.Nullable{Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum},System.Boolean)
Get analysis results.
objectType: The object type.
objectId: The object id or number (also object type must be given).
position: The position.
point: The position point (when position is POSITION_BY_COORDINATES).
valueType: The value type.
sort: True if values to be sorted.
Returns: The results.

Tekla.Structures.Analysis.AnalysisResult.Insert
Insert analysis result. Results are always stored to physical parts.
When OBJECT_TYPE_MEMBER or OBJECT_TYPE_AREA is used the analysis model must be active.
All results for given part must be inserted within one commit (CommitChanges),
older results of this part are removed automatically.
Returns: True if successful.
Insert analysis result using analysis bar number.
var analysisResult = new AnalysisResult();
analysisResult.ObjectType = AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_MEMBER;
analysisResult.ObjectId = analysisBar.Label.Number;
analysisResult.Position = AnalysisResult.ResultPositionEnum.POSITION_BEAM_START_POINT;
analysisResult.ValueType = AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Y;
analysisResult.LoadCase = 1;
analysisResult.LoadCaseName = "ULS1";
analysisResult.LoadCaseType = LoadCaseTypeEnum.COMBINATION_ULS;
analysisResult.LoadCaseInfo = "TSD class: Gravity";
analysisResult.Value = 100000.0;
var result = analysisResult.Insert();

Tekla.Structures.Analysis.AnalysisResult.QueryAnalysisResult
Replaced by GetResults.
Queries an analysis result.
Returns: True if successfully queried an analysis result.